li59533/something_for_bus/components/STM32F10x_Hal/stm32f10x_hal_tim.c
/**
 **************************************************************************************************
 * @file        stm32f10x_hal_tim.c
 * @author
 * @version
 * @date        12/6/2016
 * @brief
 **************************************************************************************************
 * @attention
 *
 **************************************************************************************************
 */
#include "stm32f10x.h"
#include "selftypedef.h"
#include "stm32f10x_hal_nvic.h"
#include "stm32f10x_hal_tim.h"

/**
 * @addtogroup    XXX 
 * @{  
 */

/**
 * @addtogroup    stm32f10x_hal_tim_Modules 
 * @{  
 */

/**
 * @defgroup      stm32f10x_hal_tim_IO_Defines 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Macros_Defines 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Constants_Defines 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Private_Types
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Private_Variables 
 * @brief         
 * @{  
 */
const TIM_BaseConfigTypedef TIM_BaseConfig[HAL_TIM_COUNT] =
{
    /* TIM1 */
    {
        TIM1,
        TIM1_UP_IRQn,
        RCC_APB2Periph_TIM1,
        {
            35 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            1000,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
    /* TIM2 */
    {
        TIM2,
        TIM2_IRQn,
        RCC_APB1Periph_TIM2,
        {
            71 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            999,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
    /* TIM3 */
    {
        TIM3,
        TIM3_IRQn,
        RCC_APB1Periph_TIM3,
        {
            35 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            1000,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
    /* TIM4 */
    {
        TIM4,
        TIM4_IRQn,
        RCC_APB1Periph_TIM4,
        {
            71 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            0xFFFF,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
    /* TIM5 */
    {
        TIM5,
        TIM5_IRQn,
        RCC_APB1Periph_TIM5,
        {
            35 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            1000,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
    /* TIM6 */
    {
        TIM6,
        TIM6_IRQn,
        RCC_APB1Periph_TIM6,
        {
            35 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            1000,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
    /* TIM7 */
    {
        TIM7,
        TIM7_IRQn,
        RCC_APB1Periph_TIM7,
        {
            71 ,    /* TIM_Prescaler */
            TIM_CounterMode_Up, /* TIM_CounterMode */
            999,   /* TIM_Period */
            TIM_CKD_DIV1,   /* TIM_ClockDivision */
            0,      /* TIM_RepetitionCounter */
        },
    },
};

const TIM_PWMOCConfigTypedef TIM_PWMOC_Config[HAL_TIM_COUNT]=
{
    /* TIM1 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Reset,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    20, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH4 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
        },
        NULL,
    },
    /* TIM2 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                ENABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    100, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_1,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
        },
        NULL, /* GPIO_Remap */
    },
    /* TIM3 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                ENABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Disable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    100, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOA,GPIOA,GPIO_Pin_7,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_0,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_1,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
        },
        NULL, /* GPIO_Remap */
    },
    /* TIM4 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    10, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                DISABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Disable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    100, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_7,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                ENABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    50, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_8,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                ENABLE, /* state */
                /* TIM_OCInitTypeDef */
                {
                    TIM_OCMode_PWM1,
                    TIM_OutputState_Enable,
                    TIM_OutputNState_Disable,/* TIM1,TIM8 only */
                    100, /* TIM_Pulse */
                    TIM_OCPolarity_Low,
                    TIM_OCNPolarity_Low,    /* TIM1,TIM8 only */
                    TIM_OCIdleState_Set,    /* TIM1,TIM8 only */
                    TIM_OCNIdleState_Reset, /* TIM1,TIM8 only */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_9,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
        },
        NULL, /* GPIO_Remap */
    },
};

const TIM_ICConfigTypedef TIM_IC_Config[HAL_TIM_COUNT] = 
{
    /* TIM1 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_1,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_2,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_3,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                ENABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_4,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_9,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
        },
        NULL,
        0,
    },
    /* TIM2 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_1,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_2,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_3,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                ENABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_4,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_9,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
        },
        NULL,
        0,
    },
    /* TIM3 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_1,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_2,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_3,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                ENABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_4,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_9,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

