li59533/something_for_bus/components/STM32F10x_Hal/stm32f10x_hal_tim.c
            },
        },
        NULL,
        0,
    },
    /* TIM4 */
    {
        /* TIM_OCChannelConfigTypedef */
        {
            /* CH1 */
            {
                ENABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_1,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},
            },
            /* CH2 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_2,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH3 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_3,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_6,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
            /* CH4 */
            {
                DISABLE, /* state */
                /* TIM_ICInitTypeDef */
                {
                    TIM_Channel_4,  /* TIM_Channel */
                    TIM_ICPolarity_Rising,  /* TIM_ICPolarity */
                    TIM_ICSelection_DirectTI,   /* TIM_ICSelection */
                    TIM_ICPSC_DIV1,     /* TIM_ICPrescaler */
                    0x00,               /* TIM_ICFilter */
                },
                /* GPIO_ConfigTypedef */
                {RCC_APB2Periph_GPIOB,GPIOB,GPIO_Pin_9,GPIO_Speed_50MHz,GPIO_Mode_AF_PP},

            },
        },
        NULL,
        1,
    },
};

TIM_InstanceTypedef TIM_Instance[HAL_TIM_COUNT]=
{
    {TIM1},
    {TIM2},
    {TIM3},
    {TIM4},
    {TIM5},
    {TIM6},
    {TIM7},
    {TIM8},
};
/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Public_Variables 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Private_FunctionPrototypes 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      stm32f10x_hal_tim_Functions 
 * @brief         
 * @{  
 */
void HAL_TIM_Base_Init(uint8_t HAL_TIMx)
{
    TIM_BaseConfigTypedef *tim_base_config;
    TIM_InstanceTypedef *tim;

    tim_base_config = (TIM_BaseConfigTypedef*)&TIM_BaseConfig[HAL_TIMx];
    tim = &TIM_Instance[HAL_TIMx];

    TIM_DeInit(tim->Instance);

    if ((HAL_TIMx == HAL_TIM1) ||
        (HAL_TIMx == HAL_TIM8))
    {
        RCC_APB2PeriphClockCmd(tim_base_config->TIM_Clock,ENABLE);
    }
    else
    {
        RCC_APB1PeriphClockCmd(tim_base_config->TIM_Clock,ENABLE);
    }

    TIM_TimeBaseInit(tim->Instance,&tim_base_config->BaseInit);
}

void HAL_TIM_Base_Open(uint8_t HAL_TIMx)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];
    tim->Instance->CNT = 0;
    TIM_Cmd(tim->Instance,ENABLE);
}

void HAL_TIM_Base_Close(uint8_t HAL_TIMx)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    TIM_Cmd(tim->Instance,DISABLE);
}

void HAL_TIM_PWMOC_Init(uint8_t HAL_TIMx)
{
    TIM_BaseConfigTypedef *tim_base_config;
    TIM_PWMOCConfigTypedef *tim_pwm_config;
    TIM_InstanceTypedef *tim;

    tim_base_config = (TIM_BaseConfigTypedef*)&TIM_BaseConfig[HAL_TIMx];
    tim_pwm_config = (TIM_PWMOCConfigTypedef*)&TIM_PWMOC_Config[HAL_TIMx];
    tim = &TIM_Instance[HAL_TIMx];

    TIM_DeInit(tim->Instance);

    if ((HAL_TIMx == HAL_TIM1) ||
        (HAL_TIMx == HAL_TIM8))
    {
        RCC_APB2PeriphClockCmd(tim_base_config->TIM_Clock,ENABLE);
    }
    else
    {
        RCC_APB1PeriphClockCmd(tim_base_config->TIM_Clock,ENABLE);
    }

    TIM_TimeBaseInit(tim->Instance,&tim_base_config->BaseInit);

    for (int i=0; i<HAL_TIM_ACTIVE_CHANNEL_COUNT; i++)
    {
        if (tim_pwm_config->OCConfig[i].State == ENABLE)
        {
            if (i==0)
            {
                TIM_OC1Init(tim->Instance,&tim_pwm_config->OCConfig[i].OCInit);
                TIM_OC1PreloadConfig(tim->Instance,TIM_OCPreload_Enable);
            }
            else if (i==1)
            {
                TIM_OC2Init(tim->Instance,&tim_pwm_config->OCConfig[i].OCInit);
                TIM_OC2PreloadConfig(tim->Instance,TIM_OCPreload_Enable);
            }
            else if (i==2)
            {
                TIM_OC3Init(tim->Instance,&tim_pwm_config->OCConfig[i].OCInit);
                TIM_OC3PreloadConfig(tim->Instance,TIM_OCPreload_Enable);
            }
            else if (i==3)
            {
                TIM_OC4Init(tim->Instance,&tim_pwm_config->OCConfig[i].OCInit);
                TIM_OC4PreloadConfig(tim->Instance,TIM_OCPreload_Enable);
            }
            
            if (tim_pwm_config->OCConfig[i].OCInit.TIM_OutputState == ENABLE)
            {
                RCC_APB2PeriphClockCmd(tim_pwm_config->OCConfig[i].Port.Clock,ENABLE);
                GPIO_Init(tim_pwm_config->OCConfig[i].Port.GPIOx, &tim_pwm_config->OCConfig[i].Port.Init); 
            }
        }
    }

    TIM_ARRPreloadConfig(tim->Instance,ENABLE);
}

