li59533/something_for_bus/components/STM32F10x_Hal/stm32f10x_hal_tim.c
void HAL_TIM_PWMOC_Open(uint8_t HAL_TIMx)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    TIM_Cmd(tim->Instance,ENABLE);
}

void HAL_TIM_PWMOC_Close(uint8_t HAL_TIMx)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    TIM_Cmd(tim->Instance,DISABLE);
}

void HAL_TIM_IC_Init(uint8_t HAL_TIMx)
{
    TIM_BaseConfigTypedef *tim_base_config;
    TIM_ICConfigTypedef *tim_ic_config;
    TIM_InstanceTypedef *tim;

    tim_base_config = (TIM_BaseConfigTypedef*)&TIM_BaseConfig[HAL_TIMx];
    tim_ic_config = (TIM_ICConfigTypedef*)&TIM_IC_Config[HAL_TIMx];
    tim = &TIM_Instance[HAL_TIMx];

    TIM_DeInit(tim->Instance);

    if ((HAL_TIMx == HAL_TIM1) ||
        (HAL_TIMx == HAL_TIM8))
    {
        RCC_APB2PeriphClockCmd(tim_base_config->TIM_Clock,ENABLE);
    }
    else
    {
        RCC_APB1PeriphClockCmd(tim_base_config->TIM_Clock,ENABLE);
    }

    TIM_TimeBaseInit(tim->Instance,&tim_base_config->BaseInit);

    for (int i=0; i<HAL_TIM_ACTIVE_CHANNEL_COUNT; i++)
    {
        if (tim_ic_config->ICConfig[i].State == ENABLE)
        {
            if (tim_ic_config->PWMInputMode)
            {
                TIM_PWMIConfig(tim->Instance,&tim_ic_config->ICConfig[i].ICInit);
                TIM_SelectInputTrigger(tim->Instance,TIM_TS_TI1FP1);
                TIM_SelectSlaveMode(tim->Instance,TIM_SlaveMode_Reset);
                TIM_SelectMasterSlaveMode(tim->Instance,TIM_MasterSlaveMode_Enable);
            }
            else
            {
                TIM_ICInit(tim->Instance,&tim_ic_config->ICConfig[i].ICInit);
            }

            RCC_APB2PeriphClockCmd(tim_ic_config->ICConfig[i].Port.Clock,ENABLE);
            GPIO_Init(tim_ic_config->ICConfig[i].Port.GPIOx,&tim_ic_config->ICConfig[i].Port.Init);
        }
    }
}

void HAL_TIM_IC_Open(uint8_t HAL_TIMx)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    TIM_Cmd(tim->Instance,ENABLE);
}

void HAL_TIM_IC_Close(uint8_t HAL_TIMx)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    TIM_Cmd(tim->Instance,DISABLE);
}

void HAL_TIM_PrescalerConfig(uint8_t HAL_TIMx,uint16_t prescaler,uint16_t TIM_PSCReloadMode)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    TIM_PrescalerConfig(tim->Instance,prescaler,TIM_PSCReloadMode);
}

void HAL_TIM_PeriodConfig(uint8_t HAL_TIMx,uint16_t period)
{
    TIM_InstanceTypedef *tim;

    tim = &TIM_Instance[HAL_TIMx];

    tim->Instance->ARR = period;
    tim->Instance->EGR = 0x0001;
}

void HAL_TIM_ITConfig(uint8_t HAL_TIMx,uint16_t TIM_IT,uint8_t PrePriority,uint8_t SubPriority,FunctionalState NewState)
{
    TIM_InstanceTypedef *tim;
    tim = &TIM_Instance[HAL_TIMx];
    HAL_NVIC_Config(TIM_BaseConfig[HAL_TIMx].TIM_IRQn,PrePriority,SubPriority,NewState);
    TIM_ITConfig(tim->Instance,TIM_IT,NewState);
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

